In [1]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [2]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
from numpy import nan as NA

In [7]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [8]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [11]:
cleaned = data.dropna()

In [12]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data[4] = NA

In [16]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
df = pd.DataFrame(np.random.randn(7, 3))

In [19]:
df.iloc[:4, 1] = NA

In [20]:
df.iloc[:2, 2] = NA

In [21]:
df

          0         1         2
0 -0.500973       NaN       NaN
1 -0.897448       NaN       NaN
2 -1.221688       NaN -0.986922
3  1.230626       NaN -1.287251
4  2.960874 -0.564369  0.115956
5 -1.987378 -0.805977  0.990097
6 -1.446148  0.034336  0.787838

In [22]:
df.dropna()

          0         1         2
4  2.960874 -0.564369  0.115956
5 -1.987378 -0.805977  0.990097
6 -1.446148  0.034336  0.787838

In [23]:
df.dropna(thresh=2)

          0         1         2
2 -1.221688       NaN -0.986922
3  1.230626       NaN -1.287251
4  2.960874 -0.564369  0.115956
5 -1.987378 -0.805977  0.990097
6 -1.446148  0.034336  0.787838

In [25]:
df.fillna(0)

          0         1         2
0 -0.500973  0.000000  0.000000
1 -0.897448  0.000000  0.000000
2 -1.221688  0.000000 -0.986922
3  1.230626  0.000000 -1.287251
4  2.960874 -0.564369  0.115956
5 -1.987378 -0.805977  0.990097
6 -1.446148  0.034336  0.787838

In [26]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.500973  0.500000  0.000000
1 -0.897448  0.500000  0.000000
2 -1.221688  0.500000 -0.986922
3  1.230626  0.500000 -1.287251
4  2.960874 -0.564369  0.115956
5 -1.987378 -0.805977  0.990097
6 -1.446148  0.034336  0.787838

In [27]:
_ = df.fillna(0, inplace=True)

In [28]:
df

          0         1         2
0 -0.500973  0.000000  0.000000
1 -0.897448  0.000000  0.000000
2 -1.221688  0.000000 -0.986922
3  1.230626  0.000000 -1.287251
4  2.960874 -0.564369  0.115956
5 -1.987378 -0.805977  0.990097
6 -1.446148  0.034336  0.787838

In [29]:
df = pd.DataFrame(np.random.randn(6, 3))

In [30]:
df.iloc[2:, 1] = NA

In [31]:
df.iloc[4:, 2] = NA

In [32]:
df

          0         1         2
0  0.106681 -0.041007 -1.734918
1  0.050051  1.259891 -0.912303
2  0.802034       NaN -1.306278
3 -0.148648       NaN -0.244305
4  0.869908       NaN       NaN
5 -0.469735       NaN       NaN

In [33]:
df.fillna(method='ffill')

          0         1         2
0  0.106681 -0.041007 -1.734918
1  0.050051  1.259891 -0.912303
2  0.802034  1.259891 -1.306278
3 -0.148648  1.259891 -0.244305
4  0.869908  1.259891 -0.244305
5 -0.469735  1.259891 -0.244305

In [34]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.106681 -0.041007 -1.734918
1  0.050051  1.259891 -0.912303
2  0.802034  1.259891 -1.306278
3 -0.148648  1.259891 -0.244305
4  0.869908       NaN -0.244305
5 -0.469735       NaN -0.244305

In [35]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [36]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [37]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

In [38]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [39]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [41]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [42]:
data['v1'] = range(7)

In [43]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [44]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [52]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 2, 5, 6]})

In [53]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     2.0
7    honey ham     5.0
8     nova lox     6.0

In [54]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [55]:
lowercased = data['food'].str.lower()

In [56]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [57]:
data['animal'] = lowercased.map(meat_to_animal)

In [58]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     2.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [59]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [60]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [61]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [62]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [63]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [66]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

data.replace({-999: np.nan, -1000: 0})

In [67]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [68]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [69]:
transform = lambda x: x[:4].upper()

In [70]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [72]:
data.index = data.index.map(transform)

In [73]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [75]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [76]:
data.rename(index={'OHIO': 'INDIANA'},
           columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [84]:
data.rename(index={'OHIO': 'INDANA'}, inplace=True)

In [86]:
data

        one  two  three  four
INDANA    0    1      2     3
COLO      4    5      6     7
NEW       8    9     10    11

In [1]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [4]:
import pandas as pd
bins = [18, 25, 35, 60, 100]

In [5]:
cats = pd.cut(ages, bins)

In [6]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [7]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [8]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [9]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [11]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [12]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [13]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [14]:
import numpy as np
data = np.random.rand(20)

In [15]:
pd.cut(data, 4, precision=2)

[(0.24, 0.47], (0.47, 0.7], (0.0074, 0.24], (0.0074, 0.24], (0.24, 0.47], ..., (0.7, 0.93], (0.24, 0.47], (0.0074, 0.24], (0.24, 0.47], (0.0074, 0.24]]
Length: 20
Categories (4, interval[float64]): [(0.0074, 0.24] < (0.24, 0.47] < (0.47, 0.7] < (0.7, 0.93]]

In [16]:
import numpy as np
data = np.random.rand(20)

In [23]:
pd.cut(data, 4, precision=2)

[(0.76, 1.0], (0.28, 0.52], (0.52, 0.76], (0.52, 0.76], (0.76, 1.0], ..., (0.043, 0.28], (0.76, 1.0], (0.52, 0.76], (0.52, 0.76], (0.043, 0.28]]
Length: 20
Categories (4, interval[float64]): [(0.043, 0.28] < (0.28, 0.52] < (0.52, 0.76] < (0.76, 1.0]]

In [24]:
data = np.random.randn(1000)

In [25]:
cats = pd.qcut(data, 4)

In [26]:
cats

[(-0.0613, 0.685], (-0.0613, 0.685], (-0.0613, 0.685], (-0.77, -0.0613], (-0.0613, 0.685], ..., (-0.0613, 0.685], (-3.339, -0.77], (-0.77, -0.0613], (-0.0613, 0.685], (0.685, 3.352]]
Length: 1000
Categories (4, interval[float64]): [(-3.339, -0.77] < (-0.77, -0.0613] < (-0.0613, 0.685] < (0.685, 3.352]]

In [27]:
pd.value_counts(cats)

(0.685, 3.352]      250
(-0.0613, 0.685]    250
(-0.77, -0.0613]    250
(-3.339, -0.77]     250
dtype: int64

In [28]:
data = np.random.randn(1000)

In [29]:
cats = pd.qcut(data, 4)

In [30]:
cats

[(-2.846, -0.635], (-2.846, -0.635], (0.668, 2.962], (0.00265, 0.668], (-2.846, -0.635], ..., (0.668, 2.962], (-0.635, 0.00265], (0.00265, 0.668], (-0.635, 0.00265], (0.668, 2.962]]
Length: 1000
Categories (4, interval[float64]): [(-2.846, -0.635] < (-0.635, 0.00265] < (0.00265, 0.668] < (0.668, 2.962]]

In [31]:
pd.value_counts(cats)

(0.668, 2.962]       250
(0.00265, 0.668]     250
(-0.635, 0.00265]    250
(-2.846, -0.635]     250
dtype: int64

In [32]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-2.846, -1.168], (-1.168, 0.00265], (1.329, 2.962], (0.00265, 1.329], (-2.846, -1.168], ..., (0.00265, 1.329], (-1.168, 0.00265], (0.00265, 1.329], (-1.168, 0.00265], (1.329, 2.962]]
Length: 1000
Categories (4, interval[float64]): [(-2.846, -1.168] < (-1.168, 0.00265] < (0.00265, 1.329] < (1.329, 2.962]]

In [33]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [34]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.022534     0.024492     0.041754     0.015657
std       1.016628     0.975613     1.004261     0.978213
min      -3.056450    -2.650210    -4.078502    -3.013377
25%      -0.691344    -0.637733    -0.656508    -0.660093
50%      -0.034535     0.028887     0.043437     0.001361
75%       0.645413     0.684608     0.736689     0.681417
max       3.416779     3.207397     3.229515     2.939327

In [35]:
col = data[2]

In [36]:
col[np.abs(col) > 3]

751    3.161044
760    3.229515
837   -4.078502
Name: 2, dtype: float64

In [37]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
15  -3.056450 -1.831791 -0.757943  0.484715
23  -0.563437  3.207397  0.245133 -0.677107
531  3.416779  0.629052  0.257928 -0.879005
751 -0.436240  0.855767  3.161044 -1.433336
760 -0.842110  0.801835  3.229515 -0.189904
835  0.989639 -1.051787  0.681951 -3.013377
837  1.228030  1.585082 -4.078502 -2.792247
920  3.152577 -1.495953  0.676441 -1.185001

In [38]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [39]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.023047     0.024285     0.042442     0.015671
std       1.014668     0.974958     0.999207     0.978172
min      -3.000000    -2.650210    -3.000000    -3.000000
25%      -0.691344    -0.637733    -0.656508    -0.660093
50%      -0.034535     0.028887     0.043437     0.001361
75%       0.645413     0.684608     0.736689     0.681417
max       3.000000     3.000000     3.000000     2.939327

In [40]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0  1.0
1 -1.0  1.0  1.0 -1.0
2 -1.0 -1.0 -1.0  1.0
3 -1.0 -1.0 -1.0  1.0
4 -1.0 -1.0 -1.0 -1.0

In [41]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [42]:
sampler = np.random.permutation(5)

In [43]:
sampler

array([4, 3, 0, 2, 1])

In [44]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [45]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
0   0   1   2   3
2   8   9  10  11
1   4   5   6   7

In [46]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7

In [47]:
choices = pd.Series([5, 7, -1, 6, 4])

In [48]:
draws = choices.sample(n=10, replace=True)

In [49]:
draws

3    6
3    6
2   -1
4    4
2   -1
0    5
0    5
2   -1
2   -1
3    6
dtype: int64

In [50]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

In [51]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [52]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [53]:
df_with_dummy = df[['data1']].join(dummies)

In [54]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [55]:
mnames = ['movie_id', 'title', 'genres']

In [57]:
movies = pd.read_table(r'C:\Users\wpx\datasets\movielens\movies.dat', sep='::',
                       header=None, names=mnames)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

In [58]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [59]:
all_genres = []

In [60]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [61]:
genres = pd.unique(all_genres)

In [62]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [63]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [64]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [65]:
gen = movies.genres[0]

In [66]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [67]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [68]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [69]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [70]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [71]:
np.random.seed(12345)

In [72]:
values = np.random.rand(10)

In [73]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [74]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [75]:
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [1]:
val = 'a,b,  guido'

In [2]:
val.split(',')

['a', 'b', '  guido']

In [3]:
pieces = [x.strip() for x in val.split(',')]

In [4]:
pieces

['a', 'b', 'guido']

In [5]:
first, second, third = pieces

In [6]:
first + '::' + second + '::' + third

'a::b::guido'

In [7]:
'::'.join(pieces)

'a::b::guido'

In [8]:
'guido' in val

True

In [9]:
val.index(',')

1

In [10]:
val.find(':')

-1

In [11]:
val.index(':')

ValueError: substring not found

In [12]:
val.count(',')

2

In [13]:
val.replace(',', '::')

'a::b::  guido'

In [14]:
val.replace(',', '')

'ab  guido'

In [26]:
import re

In [27]:
text = "foo    bar\t baz  \tqux"

In [28]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [29]:
regex = re.compile('\s+')

In [30]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [31]:
regex.findall(text)

['    ', '\t ', '  \t']

In [35]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmile.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [36]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmile.com', 'ryan@yahoo.com']

In [37]:
m = regex.search(text)

In [38]:
m

In [39]:
text[m.start():m.end()]

'dave@google.com'

In [40]:
print(regex.match(text))

None

In [42]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [44]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [45]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [47]:
m = regex.match('wesm@bright.net')

In [48]:
m.groups()

('wesm', 'bright', 'net')

In [49]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmile', 'com'),
 ('ryan', 'yahoo', 'com')]

In [50]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmile, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [54]:
import numpy as np
import pandas as pd
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmile.com',
        'Rob': 'rob@gmile.com', 'Wes':np.nan}

In [55]:
data = pd.Series(data)

In [56]:
data

Dave     dave@google.com
Steve    steve@gmile.com
Rob        rob@gmile.com
Wes                  NaN
dtype: object

In [57]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [58]:
data.str.contains('g,ail')

Dave     False
Steve    False
Rob      False
Wes        NaN
dtype: object

In [59]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [60]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmile, com)]
Rob        [(rob, gmile, com)]
Wes                        NaN
dtype: object

In [61]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [64]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object